Revit 2024 API
MEPAnalyticalNode.IsFlowBlocked Property
 Is the flow blocked at this analytical node?
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public bool IsFlowBlocked { get; }
Visual Basic
Public ReadOnly Property IsFlowBlocked As Boolean
	Get
Visual C++
public:
property bool IsFlowBlocked {
	bool get ();
}
See Also
MEPAnalyticalNode Class
Autodesk.Revit.DB.Analysis Namespace